import 'package:Persis/Persis/modules/game_screen.dart';
import 'package:Persis/Persis/structure/constants.dart';
import 'package:Persis/Persis/style/colors.dart';
import 'package:flutter/material.dart';

class InfoScreen extends StatelessWidget {
  const InfoScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: darkColor,
      appBar: AppBar(
        backgroundColor: darkColor,
        title: const Center(
          child: Text(
            'حول اللعبة',
            style: TextStyle(
              color: Colors.white,
              fontSize: 18,
              fontWeight: FontWeight.bold
            ),
          ),
        ),
        actions: const[
          SizedBox(width: 50,),
        ],
        leading: IconButton(
          icon: const Icon(Icons.arrow_back, color: Colors.white,),
          onPressed: (){
            navigateAndFinish(context, const GameScreen());
          },
        ),
      ),
      body: const Column(
        children: [
          Expanded(
            child: SingleChildScrollView(
              physics: BouncingScrollPhysics(),
              child: Padding(
                padding: EdgeInsets.all(20.0),
                child: Column(
                  children: [
                    Text(
                      'برجيس هي لعبة شعبية يلعبها لاعبان ذات أصول هندية، معروفة في تراث بلاد '
                      'الشام، حيث أدخلها السوريون إلى المنطقة في بدايةالقرن العشرين\n '
                      'يلعب في هذه اللعبة بالعادة لاعبان، لكل لاعب مكان للبداية منه واالانتهاء إليه '
                      '\n \n \n'
                          'كيفية اللعب:\n\n'
                          'تبدأ اللعبة بجميع الأحجار خارج الرقعة، يرمي اللاعبان أحجار الودع بالتناوب، ويتم اللعب عن طريق السير بالأحجار بحيث يلف كل المسار ثم يصل إلى المنتصف (المطبخ)، وإذا تصادف وجود حجر خصمه في نفس المكان الذي يتحرك إليه اللاعب فإنه يخرج (يطرد) هذا الحجر من اللعبة وعلى اللاعب هنا أن يبدأ بإدخاله من جديد. الفائز هو اللاعب الذي يوصل الحجارة الأربعة إلى المطبخ قبل الآخر.\n\n\n'
                          'لكل ودع اتجاهين أعلى وأسفل والرميات المحتملة هي:\n\n'
                          '1) الدست: وهو أن تكون جميع الودعات مقلوبة إلى أعلى ما عدا ودعة واحدة\n'
                          '2) الدواق (اثنين): وهو أن تكون جميع الودعات مقلوبة إلى أعلى ما عدا ودعتين اثنتين\n'
                          '3) ثلاثة: وهو أن تكون جميع الودعات مقلوبة إلى أعلى ما عدا ثلاث ودعات\n'
                          '4) أربعة: وهو أن تكون جميع الودعات مقلوبة إلى أعلى ما عدا أربع ودعات\n'
                          '5) البنج: وهو أن تكون جميع الودعات مقلوبة إلى أسفل ما عدا ودعة واحدة\n'
                          '6) الشكة: وهو أن تكون جميع الودعات مقلوبة إلى أعلى\n'
                          '7) البارا: وهو أن تكون جميع الودعات مقلوبة إلى أسفل\n\n\n'
                          'قيمة رمية الودع:\n\n'
                          'لكل نوع من الودع عدد مقابل من الخطوات يتم اللعب بها.\n'
                          '1) الدست: يتكون من 10 خطوات + الخال\n'
                          '2) البنج يتكون من 24 خطوة + الخال\n'
                          '3) الشكة: 6 خطوات\n'
                          '4) البارا: 12 خطوة\n'
                          '5) الدواق: خطوتين\n'
                          '6) ثلاثة: ثلاث خطوات\n'
                          '7) أربعة: أربع خطوات\n\n'
                          'الخال هو خطوة إضافية (قيمتها 1) تكون عند حصول اللاعب على دست أو بنج، يمكن لللاعب أن يتحرك بها خطوة واحدة إلى الأمام أو أن يدخل حجرا جديداً إلى الرقعة.\n\n\n'
                          'شروط وطريقة اللعب:\n\n'
                          '1) يمكن للاعب أن يدخل حجراً واحداً عندما يحصل على الخال، والخال إما أن يكون ناتج من رمية الدست، أو البنج، واللاعب الذي يحصل على الخال لا يمكن له أن يدخل حجراً إلا إذا حصل على خال حجراً بإحدى هاتين الرميتين، وبالتالي قد يلعب في البداية أكثر من مرة دون تحريك أي قطعة وذلك بسبب عدم وجود أي حجر في الرقعة لديه وعدم حصوله على الخال. ولا يجب على اللاعب إدخال حجر في حال حصوله على الخال، وإنما يمكنه فقط تحريك أحد حجاره خطوة واحدة إلى الأمام.\n\n'
                          '2) يجب على اللاعب رمي الودع مرة ثانية (دون الانتقال اللعب إلى خصمه) عند حصوله على الدست أو البنج أو الشكة أو البارا، ومن ثم تحريك الحجارة باستخدام جميع خطوات الودع التي حصل عليها.\n\n'
                          '3) يمكن أكثر من حجر لنفس اللاعب الوقوف على نفس الخانة.\n\n'
                          '4) عند وقوف حجر إحدى الفريقين على المربعات التي عليها علامات X لا يحق لللاعب الآخر طرد حجر نظيره. ولا يحق له الوقوف على نفس الخانة.\n\n'
                          '5) يجب على اللاعب المشي بكل حجر دورة كاملة من مكان دخوله حتى نهاية الرقعة في المنتصف (المطبخ). أي يجب أن تكون الخطوة الأخيرة تساوي تماماً عدد الخاليا الباقية + 1 (مكان المطبخ).\n\n'
                          '6) تنتهي اللعبة بمجرد أن يقوم أحد اللاعبين بإدخال كافة أحجاره إلى المربع في المنتصف (يعني كل حجاره طبخوا)، وبذلك يكون اللاعب قد فاز.\n\n'
                          '7) عند رمي الودع من الممكن ألا يكون للاعب أي لعبة ممكنة، مثال جد أحجار في الرقعة أو أن عدد الخطوات الباقية للحجر لا تساوي مقدار خطوات الودع... في هذه الحالة يتم انتقال اللعب للاعب الآخر.\n\n'
                      ,
                      style: TextStyle(
                        color: Colors.white,
                        fontWeight: FontWeight.bold,
                        fontSize: 12,
                      ),
                      textDirection: TextDirection.rtl,
                      maxLines: 9000,
                    ),
                  ],
                ),
              ),
            ),
          ),
        ],
      ),
    );
  }
}